embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/math/powerquad_math.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_debug_console.h"
#include "board.h"
#include "fsl_powerquad.h"
#include "math.h"

#include "pin_mux.h"
#include "clock_config.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_POWERQUAD POWERQUAD
#define MATH_EXAMPLE_LEN 32
#define MATH_PI 3.1415926535898
#define FLOAT_2_Q31(x) ((int32_t)((x)*2147483648.0f))
#define FLOAT_2_Q15(x) (int16_t) __SSAT(((int32_t)((x)*32768.0f)), 16)
#define EXAMPLE_ASSERT_TRUE(x)            \
    if (!(x))                             \
    {                                     \
        PRINTF("%s error\r\n", __func__); \
        while (1)                         \
        {                                 \
        }                                 \
    }

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void PQ_MathLnFixedExample(void);
static void PQ_MathLnFloatExample(void);
static void PQ_MathInvFixedExample(void);
static void PQ_MathInvFloatExample(void);
static void PQ_MathSqrtFixedExample(void);
static void PQ_MathSqrtFloatExample(void);
static void PQ_MathInvSqrtFixedExample(void);
static void PQ_MathInvSqrtFloatExample(void);
static void PQ_MathEtoxFixedExample(void);
static void PQ_MathEtoxFloatExample(void);
static void PQ_MathEtonxFixedExample(void);
static void PQ_MathEtonxFloatExample(void);
static void PQ_MathSinQ31Example(void);
static void PQ_MathSinFloatExample(void);
static void PQ_MathCosQ31Example(void);
static void PQ_MathCosFloatExample(void);
static void PQ_MathDivFloatExample(void);
static void PQ_MathArctanFixedExample(void);
static void PQ_MathArctanhFixedExample(void);

/* Vector functions. */
static void PQ_VectorLnFloatExample(void);
static void PQ_VectorLnFixed32Example(void);
static void PQ_VectorLnFixed16Example(void);
static void PQ_VectorInvFloatExample(void);
static void PQ_VectorInvFixed32Example(void);
static void PQ_VectorInvFixed16Example(void);
static void PQ_VectorSqrtFloatExample(void);
static void PQ_VectorSqrtFixed32Example(void);
static void PQ_VectorSqrtFixed16Example(void);
static void PQ_VectorInvSqrtFloatExample(void);
static void PQ_VectorInvSqrtFixed32Example(void);
static void PQ_VectorInvSqrtFixed16Example(void);
static void PQ_VectorEtoxFloatExample(void);
static void PQ_VectorEtoxFixed32Example(void);
static void PQ_VectorEtoxFixed16Example(void);
static void PQ_VectorEtonxFloatExample(void);
static void PQ_VectorEtonxFixed32Example(void);
static void PQ_VectorEtonxFixed16Example(void);
static void PQ_VectorSinFloatExample(void);
static void PQ_VectorSinQ31Example(void);
static void PQ_VectorSinQ15Example(void);
static void PQ_VectorCosFloatExample(void);
static void PQ_VectorCosQ31Example(void);
static void PQ_VectorCosQ15Example(void);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief Main function
 */
int main(void)
{
    /* Board pin, clock, debug console init */
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    /* Power up PQ RAM. */
    SYSCTL0->PDRUNCFG1_CLR = SYSCTL0_PDRUNCFG1_PQ_SRAM_APD_MASK | SYSCTL0_PDRUNCFG1_PQ_SRAM_PPD_MASK;
    /* Apply power setting. */
    PMC->CTRL |= PMC_CTRL_APPLYCFG_MASK;

    PRINTF("POWERQUAD math example started\r\n");

    PQ_Init(DEMO_POWERQUAD);

    PQ_MathLnFixedExample();
    PQ_MathLnFloatExample();
    PQ_MathInvFixedExample();
    PQ_MathInvFloatExample();
    PQ_MathSqrtFixedExample();
    PQ_MathSqrtFloatExample();
    PQ_MathInvSqrtFixedExample();
    PQ_MathInvSqrtFloatExample();
    PQ_MathEtoxFixedExample();
    PQ_MathEtoxFloatExample();
    PQ_MathEtonxFixedExample();
    PQ_MathEtonxFloatExample();
    PQ_MathSinQ31Example();
    PQ_MathSinFloatExample();
    PQ_MathCosQ31Example();
    PQ_MathCosFloatExample();
    PQ_MathDivFloatExample();
    PQ_MathArctanFixedExample();
    PQ_MathArctanhFixedExample();

    PQ_VectorLnFloatExample();
    PQ_VectorLnFixed32Example();
    PQ_VectorLnFixed16Example();
    PQ_VectorInvFloatExample();
    PQ_VectorInvFixed32Example();
    PQ_VectorInvFixed16Example();
    PQ_VectorSqrtFloatExample();
    PQ_VectorSqrtFixed32Example();
    PQ_VectorSqrtFixed16Example();
    PQ_VectorInvSqrtFloatExample();
    PQ_VectorInvSqrtFixed32Example();
    PQ_VectorInvSqrtFixed16Example();
    PQ_VectorEtoxFloatExample();
    PQ_VectorEtoxFixed32Example();
    PQ_VectorEtoxFixed16Example();
    PQ_VectorEtonxFloatExample();
    PQ_VectorEtonxFixed32Example();
    PQ_VectorEtonxFixed16Example();
    PQ_VectorSinFloatExample();
    PQ_VectorSinQ31Example();
    PQ_VectorSinQ15Example();
    PQ_VectorCosFloatExample();
    PQ_VectorCosQ31Example();
    PQ_VectorCosQ15Example();

    PRINTF("POWERQUAD math example successed\r\n");

    while (1)
    {
    }
}

/* Fixed Natural Log */
static void PQ_MathLnFixedExample(void)
{
    int32_t input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    /*
     * The output scale is set to 16, so the output result is multiplied by 2^^16
     */
    const pq_prescale_t prescale = {
        .inputPrescale = 0, .outputPrescale = 16, .outputSaturate = 0,
    };

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (int32_t)(log(input) * (float)(1 << 16));
        result = PQ_LnFixed(input);

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 1);
    }
}

/* Float Natural Log */
static void PQ_MathLnFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (float)(log(input));
        PQ_LnF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.000001);
    }
}

/* Fixed Reciprocal */
static void PQ_MathInvFixedExample(void)
{
    int32_t input;
    int32_t result;
    int32_t ref;
    uint32_t i;

