embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/math/powerquad_math.c
    /*
     * The output scale is set to 16, so the output result is multiplied by 2^^16
     */
    const pq_prescale_t prescale = {
        .inputPrescale = 0, .outputPrescale = 16, .outputSaturate = 0,
    };

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (int32_t)(1.0f / (float)input * (float)(1 << 16));
        result = PQ_InvFixed(input);

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 1);
    }
}

/* Float Reciprocal */
static void PQ_MathInvFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = 1.0f / (float)input;
        PQ_InvF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.000001);
    }
}

/* Fixed Square-root */
static void PQ_MathSqrtFixedExample(void)
{
    int32_t input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    /*
     * The output scale is set to 16, so the output result is multiplied by 2^^16
     */
    const pq_prescale_t prescale = {
        .inputPrescale = 0, .outputPrescale = 16, .outputSaturate = 0,
    };

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (int32_t)(sqrt(input) * (float)(1 << 16));
        result = PQ_SqrtFixed(input);

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 1);
    }
}

/* Float Square-root */
static void PQ_MathSqrtFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = sqrt(input);
        PQ_SqrtF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.000001);
    }
}

/* Fixed Inverse Square-root */
static void PQ_MathInvSqrtFixedExample(void)
{
    int32_t input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    /*
     * The output scale is set to 16, so the output result is multiplied by 2^^16
     */
    const pq_prescale_t prescale = {
        .inputPrescale = 0, .outputPrescale = 16, .outputSaturate = 0,
    };

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (int32_t)(1.0f / sqrt(input) * (float)(1 << 16));
        result = PQ_InvSqrtFixed(input);

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 1);
    }
}

/* Float Inverse Square-root */
static void PQ_MathInvSqrtFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = 1.0f / sqrt(input);
        PQ_InvSqrtF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.000001);
    }
}

/* Fixed Natural Exponent */
static void PQ_MathEtoxFixedExample(void)
{
    int32_t input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    /*
     * The output scale is set to 16, so the output result is multiplied by 2^^16
     */
    const pq_prescale_t prescale = {
        .inputPrescale = -3, .outputPrescale = 16, .outputSaturate = 0,
    };

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (int32_t)(exp((float)input / 8.0f) * (float)(1 << 16));
        result = PQ_EtoxFixed(input);

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 1);
    }
}

/* F32 Natural Exponent */
static void PQ_MathEtoxFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i / 8.0f;
        ref = exp(input);
        PQ_EtoxF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.0001);
    }
}

/* Fixed Natural Exponent with negative parameter*/
static void PQ_MathEtonxFixedExample(void)
{
    int32_t input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    /*
     * The output scale is set to 16, so the output result is multiplied by 2^^16
     */
    const pq_prescale_t prescale = {
        .inputPrescale = -3, .outputPrescale = 16, .outputSaturate = 0,
    };

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    for (i = 0; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i;
        ref = (int32_t)(1.0f / exp((float)i / 8.0f) * (float)(1 << 16));
        result = PQ_EtonxFixed(input);

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 1);
    }
}

/* F32 Natural Exponent with negative parameter*/
static void PQ_MathEtonxFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 0; i <= MATH_EXAMPLE_LEN; i++)
    {
        input = i / 8.0f;
        ref = 1.0f / exp(input);
        PQ_EtonxF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.0001);
    }
}

/* Fixed sine */
static void PQ_MathSinQ31Example(void)
{
    float input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians, input range -1 to 1 (Fixed) means -pi to pi.
         */
        input = ((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f;
        ref = FLOAT_2_Q31(sin(input * MATH_PI));
        result = PQ_SinQ31(FLOAT_2_Q31(input));

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 400);
    }
}

/* Fixed sine */
static void PQ_MathSinFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians. This function calculates -pi to pi.
         */
        input = (((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f) * MATH_PI;
        ref = sin(input);
        PQ_SinF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.000001);
    }
}

/* Fixed Cosine */
static void PQ_MathCosQ31Example(void)
{
    float input;
    int32_t result;
    int32_t ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians, input range -1 to 1 (Fixed) means -pi to pi.
         */
        input = ((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f;
        ref = FLOAT_2_Q31(cos(input * MATH_PI));
        result = PQ_CosQ31(FLOAT_2_Q31(input));

        EXAMPLE_ASSERT_TRUE(abs(ref - result) <= 200);
    }
}

/* Fixed Cosine */
static void PQ_MathCosFloatExample(void)
{
    float input;
    float result;
    float ref;
    uint32_t i;

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians. This function calculates -pi to pi.
         */
        input = (((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f) * MATH_PI;
        ref = cos(input);
        PQ_CosF32(&input, &result);

        EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.000001);
    }
}

/* Float Division */
static void PQ_MathDivFloatExample(void)
{
    float result;
    float ref;
    float x1, x2;
    uint32_t i, j;

    for (i = 0; i <= MATH_EXAMPLE_LEN; i++)
    {
        for (j = 1; j <= MATH_EXAMPLE_LEN; j++)
        {
            x1 = (float)i;
            x2 = (float)j;
            ref = x1 / x2;
            PQ_DivF32(&x1, &x2, &result);

            EXAMPLE_ASSERT_TRUE(fabs(ref - result) <= 0.00002);
        }
    }
}

