embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/driver_examples/powerquad/math/powerquad_math.c
    /*
     * The output scale is set to 8, so the output result is multiplied by 2^^8
     */
    const pq_prescale_t prescale = {
        .inputPrescale = -3, .outputPrescale = 8, .outputSaturate = 0,
    };

    for (i = 1; i <= MATH_EXAMPLE_LEN; i++)
    {
        input[i - 1] = i;
        ref[i - 1] = (int16_t)(1.0f / exp((float)i / 8.0f) * (float)(1 << 8));
    }

    PQ_SetCoprocessorScaler(DEMO_POWERQUAD, &prescale);

    PQ_VectorEtonxFixed16(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(ref[i] - result[i]) <= 1);
    }
}

static void PQ_VectorSinFloatExample(void)
{
    float input[MATH_EXAMPLE_LEN];
    float result[MATH_EXAMPLE_LEN];
    float ref[MATH_EXAMPLE_LEN];
    uint32_t i;

    for (i = 0; i < MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians. This function calculates -pi to pi.
         */
        input[i] = (((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f) * MATH_PI;
        ref[i] = sin(input[i]);
    }

    PQ_VectorSinF32(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(ref[i] - result[i]) <= 0.000001);
    }

    for (; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(result[i] == 0.0f);
    }
}

static void PQ_VectorSinQ31Example(void)
{
    float inputFloat;
    int32_t input[MATH_EXAMPLE_LEN];
    int32_t result[MATH_EXAMPLE_LEN];
    int32_t ref[MATH_EXAMPLE_LEN];
    uint32_t i;

    for (i = 0; i < MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians, input range -1 to 1 (Fixed) means -pi to pi.
         */
        inputFloat = ((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f;
        input[i] = FLOAT_2_Q31(inputFloat);
        ref[i] = FLOAT_2_Q31(sin(inputFloat * MATH_PI));
    }

    PQ_VectorSinQ31(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(ref[i] - result[i]) <= 400);
    }
}

static void PQ_VectorSinQ15Example(void)
{
    float inputFloat;
    int16_t input[MATH_EXAMPLE_LEN];
    int16_t result[MATH_EXAMPLE_LEN];
    int16_t ref[MATH_EXAMPLE_LEN];
    uint32_t i;

    for (i = 0; i < MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians, input range -1 to 1 (Q15) means -pi to pi.
         */
        inputFloat = ((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f;
        input[i] = FLOAT_2_Q15(inputFloat);
        ref[i] = FLOAT_2_Q15(sin(inputFloat * MATH_PI));
    }

    PQ_VectorSinQ15(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(ref[i] - result[i]) <= 2);
    }
}

static void PQ_VectorCosFloatExample(void)
{
    float input[MATH_EXAMPLE_LEN];
    float result[MATH_EXAMPLE_LEN];
    float ref[MATH_EXAMPLE_LEN];
    uint32_t i;

    for (i = 0; i < MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians. This function calculates -pi to pi.
         */
        input[i] = (((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f) * MATH_PI;
        ref[i] = cos(input[i]);
    }

    PQ_VectorCosF32(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(ref[i] - result[i]) <= 0.000001);
    }
}

static void PQ_VectorCosQ31Example(void)
{
    float inputFloat;
    int32_t input[MATH_EXAMPLE_LEN];
    int32_t result[MATH_EXAMPLE_LEN];
    int32_t ref[MATH_EXAMPLE_LEN];
    uint32_t i;

    for (i = 0; i < MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians, input range -1 to 1 (Fixed) means -pi to pi.
         */
        inputFloat = ((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f;
        input[i] = FLOAT_2_Q31(inputFloat);
        ref[i] = FLOAT_2_Q31(cos(inputFloat * MATH_PI));
    }

    PQ_VectorCosQ31(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(ref[i] - result[i]) <= 200);
    }
}

static void PQ_VectorCosQ15Example(void)
{
    float inputFloat;
    int16_t input[MATH_EXAMPLE_LEN];
    int16_t result[MATH_EXAMPLE_LEN];
    int16_t ref[MATH_EXAMPLE_LEN];
    uint32_t i;

    for (i = 0; i < MATH_EXAMPLE_LEN; i++)
    {
        /*
         * The input value is in radians, input range -1 to 1 (Q15) means -pi to pi.
         */
        inputFloat = ((float)(i * 2) / (float)MATH_EXAMPLE_LEN) - 1.0f;
        input[i] = FLOAT_2_Q15(inputFloat);
        ref[i] = FLOAT_2_Q15(cos(inputFloat * MATH_PI));
    }

    PQ_VectorCosQ15(input, result, ARRAY_SIZE(input));

    for (i = 0; i < ARRAY_SIZE(input); i++)
    {
        EXAMPLE_ASSERT_TRUE(abs(ref[i] - result[i]) <= 2);
    }
}
